# Missing Data

In [1]:
import numpy as np
import pandas as pd

We can directly create a DataFrame with the help of Dictionary

In [2]:
d = {'A':[1, 2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1, 2, 3]}             # np.nan ----> Null Value

In [3]:
df = pd.DataFrame(d)

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

### Remove Missing Values

In [5]:
#df.dropna()  method will delete whole row/column if it contain any Null Value
df.dropna()                                 # axis = 0, for rows

     A    B  C
0  1.0  5.0  1

In [6]:
df.dropna(axis=1)                         # axis = 1, for column

   C
0  1
1  2
2  3

In [7]:
df.dropna(thresh=2)             # "thresh = 2" means it will not delete any row which contain atleast 2 values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [8]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [9]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

### Fill Missing Value

In [10]:
df.fillna(value="Fill Value")

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [11]:
df["A"]                                           # Column "A"

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [12]:
df["A"].fillna(value=df["A"].mean())              # Replace NaN with mean of the column "A"

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [13]:
df.loc[1]                                       # Row "1"

A    2.0
B    NaN
C    2.0
Name: 1, dtype: float64

In [14]:
df.loc[1].fillna(value=df.loc[1].mean())        # Replace NaN with mean of the row "1"

A    2.0
B    2.0
C    2.0
Name: 1, dtype: float64

# Groupby

In [15]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [16]:
df = pd.DataFrame(data)

In [17]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [18]:
by_comp = df.groupby("Company")             # Need to assign it in variable because it return an object

In [19]:
by_comp.mean()                          # for mean of values

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [20]:
by_comp.sum()                          # for sum of values

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [21]:
by_comp.std()                       # Compute standard deviation of groups

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [22]:
by_comp.sum().loc["FB"]

Sales    593
Name: FB, dtype: int64

In [23]:
# or
df.groupby("Company").sum().loc["FB"]

Sales    593
Name: FB, dtype: int64

In [24]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [25]:
df.groupby("Company").count()                        # count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [26]:
df.groupby("Company").min()                           # min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [27]:
df.groupby("Company").describe()             # describe() will return all different types of information

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [28]:
df.groupby("Company").describe().transpose()          # transpose() will change the format

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [29]:
df.groupby("Company").describe().transpose()["FB"]      # for single column  or company

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64